***

Q1. List any five functions of the pandas library with execution.

function 1 - read csv and html files

In [1]:
pip install pandas

Requirement already satisfied: pandas in /Users/ashu/.pyenv/versions/3.10.2/lib/python3.10/site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/ashu/.pyenv/versions/3.10.2/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/ashu/.pyenv/versions/3.10.2/lib/python3.10/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in /Users/ashu/.pyenv/versions/3.10.2/lib/python3.10/site-packages (from pandas) (1.24.2)
Requirement already satisfied: six>=1.5 in /Users/ashu/.pyenv/versions/3.10.2/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [6]:
df = pd.read_csv("75_csv_file_for_pandas.csv")

In [7]:
df.head()

,id,firstname,lastname,email,email2,profession
0,100,Rani,Cherianne,Rani.Cherianne@yopmail.com,Rani.Cherianne@gmail.com,developer
1,101,Flo,Whiffen,Flo.Whiffen@yopmail.com,Flo.Whiffen@gmail.com,worker
2,102,Berta,Vorster,Berta.Vorster@yopmail.com,Berta.Vorster@gmail.com,developer
3,103,Evaleen,Marden,Evaleen.Marden@yopmail.com,Evaleen.Marden@gmail.com,worker
4,104,Meg,Ferino,Meg.Ferino@yopmail.com,Meg.Ferino@gmail.com,worker

In [8]:
df.tail()

,id,firstname,lastname,email,email2,profession
995,1095,Benita,Kussell,Benita.Kussell@yopmail.com,Benita.Kussell@gmail.com,worker
996,1096,Carilyn,Serilda,Carilyn.Serilda@yopmail.com,Carilyn.Serilda@gmail.com,developer
997,1097,Fanchon,Hashim,Fanchon.Hashim@yopmail.com,Fanchon.Hashim@gmail.com,firefighter
998,1098,Hyacinthe,Naashom,Hyacinthe.Naashom@yopmail.com,Hyacinthe.Naashom@gmail.com,developer
999,1099,Trixi,Westphal,Trixi.Westphal@yopmail.com,Trixi.Westphal@gmail.com,worker

In [9]:
df.head(3)

,id,firstname,lastname,email,email2,profession
0,100,Rani,Cherianne,Rani.Cherianne@yopmail.com,Rani.Cherianne@gmail.com,developer
1,101,Flo,Whiffen,Flo.Whiffen@yopmail.com,Flo.Whiffen@gmail.com,worker
2,102,Berta,Vorster,Berta.Vorster@yopmail.com,Berta.Vorster@gmail.com,developer

In [10]:
df.tail(3)

,id,firstname,lastname,email,email2,profession
997,1097,Fanchon,Hashim,Fanchon.Hashim@yopmail.com,Fanchon.Hashim@gmail.com,firefighter
998,1098,Hyacinthe,Naashom,Hyacinthe.Naashom@yopmail.com,Hyacinthe.Naashom@gmail.com,developer
999,1099,Trixi,Westphal,Trixi.Westphal@yopmail.com,Trixi.Westphal@gmail.com,worker

In [11]:
df[df['profession'] == 'developer']

,id,firstname,lastname,email,email2,profession
0,100,Rani,Cherianne,Rani.Cherianne@yopmail.com,Rani.Cherianne@gmail.com,developer
2,102,Berta,Vorster,Berta.Vorster@yopmail.com,Berta.Vorster@gmail.com,developer
6,106,Lila,Manolo,Lila.Manolo@yopmail.com,Lila.Manolo@gmail.com,developer
9,109,Ninnetta,Emerson,Ninnetta.Emerson@yopmail.com,Ninnetta.Emerson@gmail.com,developer
18,118,Leona,Grayce,Leona.Grayce@yopmail.com,Leona.Grayce@gmail.com,developer
...,...,...,...,...,...,...
989,1089,Neila,Behre,Neila.Behre@yopmail.com,Neila.Behre@gmail.com,developer
991,1091,Sissy,Lamoree,Sissy.Lamoree@yopmail.com,Sissy.Lamoree@gmail.com,developer
992,1092,Cecile,Medrek,Cecile.Medrek@yopmail.com,Cecile.Medrek@gmail.com,developer
996,1096,Carilyn,Serilda,Carilyn.Serilda@yopmail.com,Carilyn.Serilda@gmail.com,developer
998,1098,Hyacinthe,Naashom,Hyacinthe.Naashom@yopmail.com,Hyacinthe.Naashom@gmail.com,developer

In [12]:
df[df['id'] > 540]

,id,firstname,lastname,email,email2,profession
441,541,Karolina,Lail,Karolina.Lail@yopmail.com,Karolina.Lail@gmail.com,firefighter
442,542,Joelly,Mauer,Joelly.Mauer@yopmail.com,Joelly.Mauer@gmail.com,developer
443,543,Elbertina,Oster,Elbertina.Oster@yopmail.com,Elbertina.Oster@gmail.com,police officer
444,544,Elvira,Erskine,Elvira.Erskine@yopmail.com,Elvira.Erskine@gmail.com,developer
445,545,Aili,Ricki,Aili.Ricki@yopmail.com,Aili.Ricki@gmail.com,doctor
...,...,...,...,...,...,...
995,1095,Benita,Kussell,Benita.Kussell@yopmail.com,Benita.Kussell@gmail.com,worker
996,1096,Carilyn,Serilda,Carilyn.Serilda@yopmail.com,Carilyn.Serilda@gmail.com,developer
997,1097,Fanchon,Hashim,Fanchon.Hashim@yopmail.com,Fanchon.Hashim@gmail.com,firefighter
998,1098,Hyacinthe,Naashom,Hyacinthe.Naashom@yopmail.com,Hyacinthe.Naashom@gmail.com,developer
999,1099,Trixi,Westphal,Trixi.Westphal@yopmail.com,Trixi.Westphal@gmail.com,worker

In [13]:
df.loc[20,['id','profession']]

id                  120
profession    developer
Name: 20, dtype: object

In [14]:
df.loc[20:25,['id','profession']]

     id      profession
20  120       developer
21  121       developer
22  122          worker
23  123  police officer
24  124       developer
25  125          worker

In [15]:
df.loc[20:100:10,['id','profession']]

      id      profession
20   120       developer
30   130       developer
40   140          worker
50   150  police officer
60   160          worker
70   170  police officer
80   180  police officer
90   190     firefighter
100  200       developer

In [17]:
df.iloc[20:100:10,[0,5]]

     id      profession
20  120       developer
30  130       developer
40  140          worker
50  150  police officer
60  160          worker
70  170  police officer
80  180  police officer
90  190     firefighter

In [18]:
pd.Categorical(df['profession'])

['developer', 'worker', 'developer', 'worker', 'worker', ..., 'worker', 'developer', 'firefighter', 'developer', 'worker']
Length: 1000
Categories (5, object): ['developer', 'doctor', 'firefighter', 'police officer', 'worker']

In [19]:
df.describe()

                id
count  1000.000000
mean    599.500000
std     288.819436
min     100.000000
25%     349.750000
50%     599.500000
75%     849.250000
max    1099.000000

In [20]:
df['fullName'] = df['firstname'] + ' ' + df['lastname']

In [21]:
df

,id,firstname,lastname,email,email2,profession,fullName
0,100,Rani,Cherianne,Rani.Cherianne@yopmail.com,Rani.Cherianne@gmail.com,developer,Rani Cherianne
1,101,Flo,Whiffen,Flo.Whiffen@yopmail.com,Flo.Whiffen@gmail.com,worker,Flo Whiffen
2,102,Berta,Vorster,Berta.Vorster@yopmail.com,Berta.Vorster@gmail.com,developer,Berta Vorster
3,103,Evaleen,Marden,Evaleen.Marden@yopmail.com,Evaleen.Marden@gmail.com,worker,Evaleen Marden
4,104,Meg,Ferino,Meg.Ferino@yopmail.com,Meg.Ferino@gmail.com,worker,Meg Ferino
...,...,...,...,...,...,...,...
995,1095,Benita,Kussell,Benita.Kussell@yopmail.com,Benita.Kussell@gmail.com,worker,Benita Kussell
996,1096,Carilyn,Serilda,Carilyn.Serilda@yopmail.com,Carilyn.Serilda@gmail.com,developer,Carilyn Serilda
997,1097,Fanchon,Hashim,Fanchon.Hashim@yopmail.com,Fanchon.Hashim@gmail.com,firefighter,Fanchon Hashim
998,1098,Hyacinthe,Naashom,Hyacinthe.Naashom@yopmail.com,Hyacinthe.Naashom@gmail.com,developer,Hyacinthe Naashom
999,1099,Trixi,Westphal,Trixi.Westphal@yopmail.com,Trixi.Westphal@gmail.com,worker,Trixi Westphal

***

2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

***

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [22]:
import pandas as pd
data = {'Age':[10,20,30,40,50]}
df = pd.DataFrame(data)

In [23]:
df

   Age
0   10
1   20
2   30
3   40
4   50

In [26]:
""" step - 1 is to extract the desired column and in my case i've taken age as the desired column """

desired_column = df['Age']

In [27]:
""" step - 2 is to extract the first three values of the desired column and it can be done using head() function """

head_value = desired_column.head(3)

In [28]:
""" step - 3 is to find the sum """

sum_value = head_value.sum()

In [29]:
""" step - 4 is to print them """

print(sum_value)

60

***
Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [33]:
""" step - 1 is to create data """

import pandas as pd

data = {'Text': ['Hello, how are you?', 'I am doing well.', 'What about you?']}
df = pd.DataFrame(data)

In [34]:
df

                  Text
0  Hello, how are you?
1     I am doing well.
2      What about you?

In [35]:
""" step - 2 is to make function that counts words size  """

def count_number_of_words(text):
    words = text.split()
    return len(words)

In [36]:
""" step - 3 is to create a column that contains the number of words in each row """

df['number_of_words'] = df["Text"].apply(count_number_of_words)

In [37]:
""" step - 4 is to print the dataframe """

df

                  Text  number_of_words
0  Hello, how are you?                4
1     I am doing well.                4
2      What about you?                3

In [38]:
df['number_of_words']

0    4
1    4
2    3
Name: number_of_words, dtype: int64

***
Q5. How are DataFrame.size() and DataFrame.shape() different?

In [40]:
df.size

6

In [41]:
df.shape

(3, 2)

DataFrame.size(): This method returns the total number of elements in the DataFrame, which is equivalent to the total number of cells. It is calculated as the product of the number of rows and the number of columns in the DataFrame. The size() method does not take any arguments.

DataFrame.shape(): This method returns a tuple representing the dimensions of the DataFrame. It returns the number of rows and the number of columns in the DataFrame as (rows, columns). The shape() method does not take any arguments.

***
Q6. Which function of pandas do we use to read an excel file?

pd.read_excel("76_practice_pandas.xlsx")

***
Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [44]:
import pandas as pd
data = {'Email':['ashu.kumarexam@gmail.com','ashu@google.com','ashu@jec.com']}
email_dataframe = pd.DataFrame(data)

In [45]:
def extract_domain_for_username(Email):
    return Email.split('@')[0]

In [46]:
email_dataframe

                      Email
0  ashu.kumarexam@gmail.com
1           ashu@google.com
2              ashu@jec.com

In [48]:
email_dataframe['username'] = email_dataframe['Email'].apply(extract_domain_for_username)

In [49]:
email_dataframe

                      Email        username
0  ashu.kumarexam@gmail.com  ashu.kumarexam
1           ashu@google.com            ashu
2              ashu@jec.com            ashu

***
Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2
Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [67]:
import pandas as pd

def select_row(df):
    selected_row = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_row


data = {'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]}
df = pd.DataFrame(data)

final_ans = select_row(df)

print(final_ans)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

***
Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [69]:
import pandas as pd
data = {'A':[10,20,30,40,50],
        'B':[100,200,300,400,500],
        'C':[1000,2000,3000,4000,5000]}

df = pd.DataFrame(data)

df.describe()

               A           B           C
count   5.000000    5.000000     5.00000
mean   30.000000  300.000000  3000.00000
std    15.811388  158.113883  1581.13883
min    10.000000  100.000000  1000.00000
25%    20.000000  200.000000  2000.00000
50%    30.000000  300.000000  3000.00000
75%    40.000000  400.000000  4000.00000
max    50.000000  500.000000  5000.00000

***
Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [75]:
import pandas as pd

def moving_average(df):
    df['moving_average'] = df['Sales'].rolling(window=7,min_periods=1).mean()
    return df

data = {'Date': ['2023-05-01', '2023-05-02', '2023-05-03', '2023-05-04', '2023-05-05', '2023-05-06', '2023-05-07', '2023-05-08'],
        'Sales': [10, 15, 12, 18, 20, 22, 17, 19]}

df= pd.DataFrame(data)

df = moving_average(df)

print(df)

         Date  Sales  moving_average
0  2023-05-01     10       10.000000
1  2023-05-02     15       12.500000
2  2023-05-03     12       12.333333
3  2023-05-04     18       13.750000
4  2023-05-05     20       15.000000
5  2023-05-06     22       16.166667
6  2023-05-07     17       16.285714
7  2023-05-08     19       17.571429

***
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [76]:
import pandas as pd

def weekday_attacher(df):
    df['weekday'] = pd.to_datetime(df['Date']).dt.day_name()
    return df

data = {'Date' :['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']}

df = pd.DataFrame(data)

df = weekday_attacher(df)

print(df)

         Date    weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

***
Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [77]:
import pandas as pd


def select_rows_between_dates(df):
    # Convert 'Date' column to datetime
    df['Date'] = pd.to_datetime(df['Date'])

    # Define the start and end dates
    start_date = '2023-01-01'
    end_date = '2023-01-31'

    # Select rows where the date is between start_date and end_date
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]

    return selected_rows

***
Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [78]:
import pandas

***